<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Author;
use App\Models\Book;
use App\Models\Genre;

class AuthorSeeder extends Seeder
{
    public function run()
    {
        // Create the first author
        $author1 = Author::create([
            'name' => 'Ілларіон Павлюк',
        ]);

        $book1 = $author1->book()->create([
            'title' => 'Я бачу вас цікавить пітьма',
            'description' => 'Київського кримінального психолога Андрія Гайстера відправляють консультантом у богом забуте селище Буськів Сад. Зимової ночі там зникла маленька дівчинка. А ще там водиться Звір — серійний маніяк, убивств якого тамтешні мешканці воліють не помічати... У цьому проклятому селищі, де все по колу і всі живуть життям, яке ненавидять, розслідування постійно заходить у глухий кут. Андрій вірить, що загублена дівчинка, попри все, жива і він її знайде. Але нікому, крім нього, це не потрібно.',
        ]);

        $book1->genre()->attach([
            Genre::firstOrCreate(['title' => 'Фікшн'])->id,
        ]);

        $book2 = $author1->book()->create([
            'title' => 'Танець недоумка',
            'description' => 'Космічний біолог Гіль, за плечима якого чимало військових операцій, переживає не найкращі часи: безробіття, безгрошів’я, сім’я на межі розлучення, ще й висока ймовірність, що проявиться спадкова генетична хвороба, в якій швидка смерть — це чи не найкращий фінал. І ось неочікувано з’являється пропозиція роботи, яка, здавалося б, вирішує всі проблеми одночасно: наукова експедиція на далеку планету. Хороші гроші, медична страховка, мінімальні ризики. Чи виявиться рішення летіти, до якого підштовхує страх, правильним? І чи такі вже мінімальні ризики на далекій і химерній планеті Іш-Чель?',
        ]);

        $book2->genre()->attach([
            Genre::firstOrCreate(['title' => 'Фікшн'])->id,
            Genre::firstOrCreate(['title' => 'Трилер'])->id,
        ]);

        $book3 = $author1->book()->create([
            'title' => 'Білий попіл',
            'description' => 'Приватному детективу Тарасу Білому замовляють розслідувати вбивство панночки. Обвинувачують такого собі семінариста Хому Брута, й справа ніби геть зрозуміла... Втім, хутір, де сталося вбивство, приховує таємницю. І ця таємниця — страшніша за всі оповідки про панночку, яка встала з гробу',
        ]);

        $book3->genre()->attach([
            Genre::firstOrCreate(['title' => 'Детектив'])->id,
        ]);

        // Create the second author
        $author2 = Author::create([
            'name' => 'Андрій Сем\'янків',
        ]);

        $book4 = $author2->book()->create([
            'title' => 'Медицина доказова і не дуже',
            'description' => '50% ліків на планеті Земля призначаються неправильно. На тій самій планеті 50% пацієнтів приймають ліки не так, як треба. Не дуже оптимістично, авжеж. Додайте до цього альтернативну медицину, гомеопатію, інста-гуру без медичної освіти, які роздають свої поради направо і наліво, та натренованих нашим «профілактичним» вживанням антибіотиків бактерій — і отримаєте повну картину.',
        ]);

        $book4->genre()->attach([
            Genre::firstOrCreate(['title' => 'Наукпоп'])->id,
        ]);

        $book5 = $author2->book()->create([
            'title' => 'Танці з кістками',
            'description' => 'Проста, на перший погляд, історія про патологоанатома-невдаху. Северина не цінують на роботі й мало платять, з особистим життям чоловіка відбувається щось незрозуміле, самооцінка на нулі. Тож перебуваючи практично на дні, він одразу ж хапається за можливість підзаробити. Так, пропозиція не зовсім легальна, так, навряд чи можна чекати чогось доброго від ринку трансплантації органів, але так спокусливо нарешті влаштувати собі забезпечене життя. Зрештою, Северин має забрати в уже мертвих людей якусь дрібничку, те, що їм і так не потрібно. Поки що у мертвих людей, поки що дрібничку.',
        ]);

        $book5->genre()->attach([
            Genre::firstOrCreate(['title' => 'Трилер'])->id,
        ]);


        $author3 = Author::create([
            'name' => 'Ірина Грабовська',
        ]);

        $book6 = $author3->book()->create([
            'title' => 'Зірки й кістки',
            'description' => 'Світ, осяяний священним світлом Зірок, уже кілька років роздирає війна. Князівство крилатих, Ретон, опиняється в епіцентрі конфлікту могутніх людських держав. На плечі юного княжича Янна лягає важкий обов\'язок: відновити спадкове право, встановити мир на рідній землі та припинити винищення одноплемінників. Але вижити у світі, де на полі бою повстають мертві, а живі керують монстрами, — це завдання геть не просте, бо вороги плетуть інтриги, а союзники вимагають завеликої плати за допомогу.',
        ]);

        $book6->genre()->attach([
            Genre::firstOrCreate(['title' => 'Фентезі'])->id,
            Genre::firstOrCreate(['title' => 'Фікшн'])->id,
        ]);

        $book7 = $author3->book()->create([
            'title' => 'Хроніки незвіданих земель',
            'description' => '"Кожне оповідання цієї збірки від відомих українських письменниць, учасниць літературного ютуб-проєкту «Фантастичні talk(s)» — це своєрідний маркер-дороговказ на часопросторовій мапі України. 15-й рік до нашої ери, 1540-й, 1941-й, початок ХХІІІ століття… У різні епохи та куточки нашої країни (і навіть її космічних поселень) приведуть вас «Хроніки незвіданих земель». Усюди — під давніми пісками Причорномор’я, в замкових мурах Поділля, під пластами чорного золота Донеччини, на старовинних вулицях Львова і навіть на українській станції на супутнику Марса — на вас чекають відкриття. Для когось це буде розгадка містичної історії, для когось — осяяння від історії давньої, а для когось — розуміння історії, яку українці пишуть просто зараз.',
        ]);

        $book7->genre()->attach([
            Genre::firstOrCreate(['title' => 'Фентезі'])->id,
        ]);
    }
}
